Repository: bkader/ci-gettext-hook
Catalog: application/language/arabic/system.po
Languages: ara

source: Su
ara: أح

source: Mo
ara: إث

source: Tu
ara: ثل

source: We
ara: أر

source: Th
ara: خم

source: Fr
ara: جم

source: Sa
ara: سب

source: Sun
ara: أح

source: Mon
ara: إث

source: Tue
ara: ثل

source: Wed
ara: أر

source: Thu
ara: خم

source: Fri
ara: جم

source: Sat
ara: سب

source: Sunday
ara: الأحد

source: Monday
ara: الإثنين

source: Tuesday
ara: الثلاثاء

source: Wednesday
ara: الأربعاء

source: Thursday
ara: الخميس

source: Friday
ara: الجمعة

source: Saturday
ara: السبت

source: Jan
ara: ينا

source: Feb
ara: فبر

source: Mar
ara: مار

source: Apr
ara: أبر

source: May
ara: ماي

source: Jun
ara: يون

source: Jul
ara: يول

source: Aug
ara: أغس

source: Sep
ara: سبت

source: Oct
ara: أوك

source: Nov
ara: نوف

source: Dec
ara: ديس

source: January
ara: يناير

source: February
ara: فبراير

source: March
ara: مارس

source: April
ara: إبريل

source: June
ara: يونيو

source: July
ara: يوليو

source: August
ara: أغسطس

source: September
ara: سبتمبر

source: October
ara: أكتوبر

source: November
ara: نوفمبر

source: December
ara: ديسمبر

source: Year
ara: سنة

source: Years
ara: سنوات

source: Month
ara: شهر

source: Months
ara: أشهر

source: Week
ara: أسبوع

source: Weeks
ara: أسابيع

source: Day
ara: يوم

source: Days
ara: أيام

source: Hour
ara: ساعة

source: Hours
ara: ساعات

source: Minute
ara: دقيقة

source: Minutes
ara: دقائق

source: Second
ara: ثانية

source: Seconds
ara: ثواني

source: (UTC -12:00) Baker/Howland Island
ara: (UTC -12:00) جزيرة بيكر/هاولاند

source: (UTC -11:00) Niue
ara: (UTC -11:00) توقيت ساموا، نيو

source: (UTC -10:00) Hawaii-Aleutian Standard Time, Cook Islands, Tahiti
ara: (UTC -10:00) توقيت هاواي-أليوت الرسمي، جُزر كوك، تاهيتي

source: (UTC -9:30) Marquesas Islands
ara: (UTC -9:30) جُزر ماركيساس

source: (UTC -9:00) Alaska Standard Time, Gambier Islands
ara: (UTC -9:00) توقيت ألاسكا الرسمي، جُزر جامبير

source: (UTC -8:00) Pacific Standard Time, Clipperton Island
ara: (UTC -8:00) توقيت الهادي الرسمي، جزيرة كليبّرتون

source: (UTC -7:00) Mountain Standard Time
ara: (UTC -7:00) توقيت ماونتاين الرسمي

source: (UTC -6:00) Central Standard Time
ara: (UTC -6:00) التوقيت المركزي الرسمي

source: (UTC -5:00) Eastern Standard Time, Western Caribbean Standard Time
ara: (UTC -5:00) التوقيت الشرقي الرسمي، توقيت شرق الكاريبي الرسمي

source: (UTC -4:30) Venezuelan Standard Time
ara: (UTC -4:30) توقيت فنزويلا الرسمي

source: (UTC -4:00) Atlantic Standard Time, Eastern Caribbean Standard Time
ara: (UTC -4:00) توقيت الأطلنطي الرسمي، توقيت شرق الكاريبي الرسمي

source: (UTC -3:30) Newfoundland Standard Time
ara: (UTC -3:30) توقيت نيوفاوندلاند الرسمي

source: (UTC -3:00) Argentina, Brazil, French Guiana, Uruguay
ara: (UTC -3:00) الأرجنتين، البرازيل، غويانا الفرنسية، الأوروغواي

source: (UTC -2:00) South Georgia/South Sandwich Islands
ara: (UTC -2:00) غرب جورجيا، جُزر غرب ساندويتش

source: (UTC -1:00) Azores, Cape Verde Islands
ara: (UTC -1:00) الأزور، جُزر كيب فيرد

source: (UTC) Greenwich Mean Time, Western European Time
ara: (UTC) توقيت غرينتش، توقيت غرب أوروبا

source: (UTC +1:00) Central European Time, West Africa Time
ara: (UTC +1:00) توقيت وسط أوروبا، توقيت غرب إفريقيا

source: (UTC +2:00) Central Africa Time, Eastern European Time, Kaliningrad Time
ara: (UTC +2:00) توقيت وسط أفريقيا، توقيت شرق أوروبا، توقيت كالننغراد

source: (UTC +3:00) Moscow Time, East Africa Time, Arabia Standard Time
ara: (UTC +3:00) توقيت موسكو، توقيت شرق إفريقيا

source: (UTC +3:30) Iran Standard Time
ara: (UTC +3:30) توقيت إيران الرسمي

source: (UTC +4:00) Azerbaijan Standard Time, Samara Time
ara: (UTC +4:00) توقيت أذربيجان الرسمي، توقيت سمارا

source: (UTC +4:30) Afghanistan
ara: (UTC +4:30) أفغانستان

source: (UTC +5:00) Pakistan Standard Time, Yekaterinburg Time
ara: (UTC +5:00) توقيت باكستان الرسمي، توقيت نِكاتيريبورغ

source: (UTC +5:30) Indian Standard Time, Sri Lanka Time
ara: (UTC +5:30) توقيت الهند الرسمي، توقيت سريلانكا

source: (UTC +5:45) Nepal Time
ara: (UTC +5:45) توقيت نيبال

source: (UTC +6:00) Bangladesh Standard Time, Bhutan Time, Omsk Time
ara: (UTC +6:00) تويقت بنغلادش الرسمي، توقيت بوتان، توقيت أمسك

source: (UTC +6:30) Cocos Islands, Myanmar
ara: (UTC +6:30) جُزر كوكوس، ميانمار

source: (UTC +7:00) Krasnoyarsk Time, Cambodia, Laos, Thailand, Vietnam
ara: (UTC +7:00) توقيت كراسنويارسك، كمبوديا، لاوس، تايلاند، الفيتنام

source: (UTC +8:00) Australian Western Standard Time, Beijing Time, Irkutsk Time
ara: (UTC +8:00) توقيت غرب أستراليا الرسمي، توقيت بيينغ، توقيت إركتسك

source: (UTC +8:45) Australian Central Western Standard Time
ara: (UTC +8:45) توقيت غرب وسط أستراليا الرسمي

source: (UTC +9:00) Japan Standard Time, Korea Standard Time, Yakutsk Time
ara: (UTC +9:00) توقيت اليابان الرسمي، توقيت كوريا الرسمي، توقيت ياكوتسك

source: (UTC +9:30) Australian Central Standard Time
ara: (UTC +9:30) توقيت وسط أستراليا الرسمي

source: (UTC +10:00) Australian Eastern Standard Time, Vladivostok Time
ara: (UTC +10:00) توقيت شرق أستراليا الرسمي، توقيت فلاديفوستوك

source: (UTC +10:30) Lord Howe Island
ara: (UTC +10:30) جُزر لورد هووي

source: (UTC +11:00) Srednekolymsk Time, Solomon Islands, Vanuatu
ara: (UTC +11:00) توقيت ماغادان، جُزر سليمان، فاناتاو

source: (UTC +11:30) Norfolk Island
ara: (UTC +11:30) جزيرة نورفولك

source: (UTC +12:00) Fiji, Gilbert Islands, Kamchatka Time, New Zealand Standard Time
ara: (UTC +12:00) توقيت فيجي، جُزر جلبير، كاماتشاتكا، توقيت نيوزلنده الرسمي

source: (UTC +12:45) Chatham Islands Standard Time
ara: (UTC +12:45) توقيت جُزر تشاذام الرسمي

source: (UTC +13:00) Samoa Time Zone, Phoenix Islands Time, Tonga
ara: (UTC +13:00) توقيت جُزر فينكس، تونغا

source: (UTC +14:00) Line Islands
ara: (UTC +14:00) جُزر لاين

source: Unable to determine the database settings based on the connection string you submitted.
ara: غير قادر على إيجاد إعدادات الإتصال بقواعد البيانات بناء على البيانات المرسلة.

source: Unable to connect to your database server using the provided settings.
ara: غير قادر على الإتصال بقواعد البيانات بناء على الإعدادات المقدمة.

source: Unable to select the specified database: %s
ara: غير قادر على تحديد قاعدة البيانات التالية: %s

source: Unable to create the specified database: %s
ara: غير قادر على إنشاء قاعدة البيانات التالية: %s

source: The query you submitted is not valid.
ara: الإستعلام المرسل غير صحيح.

source: You must set the database table to be used with your query.
ara: يجب وضع جدول قاعدة بيانات للإستخدامة مع الإستعلام.

source: You must use the "set" method to update an entry.
ara: يجب إستخدام خاصية "set" لتحديث السجيل.

source: You must specify an index to match on for batch updates.
ara: يجب تحديد رقم للتحديثات.

source: One or more rows submitted for batch updating is missing the specified index.
ara: سجل أو أكثر لا يحتوى على رقم التحديث.

source: Updates are not allowed unless they contain a "where" clause.
ara: التحديث غير مسموح به مالم يحتوى على جملة "where" أو "like".

source: Deletes are not allowed unless they contain a "where" or "like" clause.
ara: الحذف غير مسموح به مالم يحتوى على جملة "where" أو "like".

source: To fetch fields requires the name of the table as a parameter.
ara: لجلب أسماء الحقول يجب إرسال إسم الجدول كمتغير.

source: This feature is not available for the database you are using.
ara: هذه الميزة غير متوفرة في قاعدة البيانات التى تستخدمها.

source: Transaction failure: Rollback performed.
ara: فشل في الإجراء: تم التراجع عن الإجراء.

source: Unable to drop the specified database.
ara: غير قادر على إزالة قاعدة البيانات المحددة.

source: Unsupported feature of the database platform you are using.
ara: ميزة غير متوفرة في قاعدة البيانات التى تستخدمها.

source: The file compression format you chose is not supported by your server.
ara: نوع ضغط الملف المحدد غير مدعوم على الخادم.

source: Unable to write data to the file path you have submitted.
ara: غير قادر على كتابة الملف في المسار المحدد.

source: The cache path you submitted is not valid or writable.
ara: مسار التخزين المؤقت غير صحيح أو غير قابل للكتابة.

source: A table name is required for that operation.
ara: إسم الجدول مطلوب لهذه العملية.

source: A column name is required for that operation.
ara: إسم العمود مطلوب لهذه العملية.

source: A column definition is required for that operation.
ara: تعريف العمود مطلوب لهذه العملية.

source: Unable to set client connection character set: %s
ara: غير قادر على تحديد نوع الترميز: %s

source: A Database Error Occurred
ara: حصل خطأ في قاعدة البيانات

source: The email validation method must be passed an array.
ara: يجب تمرير مصفوفة إلى دالة التحقق من البريد الإلكتروني.

source: Invalid email address: %s
ara: عنوان بريد إلكتروني خاطيء: %s

source: Unable to locate the following email attachment: %s
ara: غير قادر على إيجاد الملف المرفق: %s

source: Unable to open this attachment: %s
ara: غير قاد على فتح الملف المرفق: %s

source: Cannot send mail with no "From" header.
ara: لا يمكن إرسال البريد الإلكتروني بدون تحديد المرسل.

source: You must include recipients: To, Cc, or Bcc
ara: يجب إضافة مستقبلين: To, Cc, or Bcc

source: Unable to send email using PHP mail(). Your server might not be configured to send mail using this method.
ara: غير قادر على الإرسال بإستخدام PHP mail(). قد يكون الخادم غير معد للإرسال بإستخدام هذه الطريقة.

source: Unable to send email using PHP Sendmail. Your server might not be configured to send mail using this method.
ara: غير قادر على الإرسال بإستخدام PHP Sendmail. قد يكون الخادم غير معد للإرسال بإستخدام هذه الطريقة.

source: Unable to send email using PHP SMTP. Your server might not be configured to send mail using this method.
ara: غير قادر على الإرسال بإستخدام PHP SMTP. قد يكون الخادم غير معد للإرسال بإستخدام هذه الطريقة.

source: Your message has been successfully sent using the following protocol: %s
ara: تم إرسال الرسالة بنجاح بإستخدام البروتوكول التالي: %s

source: Unable to open a socket to Sendmail. Please check settings.
ara: غير قادر على فتح إتصال مع Sendmail. الرجاء التأكد من الإعدادات.

source: You did not specify a SMTP hostname.
ara: لم تحدد إسم المضيف لـ SMTP.

source: The following SMTP error was encountered: %s
ara: حدث خطأ SMTP: %s

source: Error: You must assign a SMTP username and password.
ara: خطأ: يجب تحديد إسم مستخدم وكلمة مرور لـ SMTP.

source: Failed to send AUTH LOGIN command. Error: %s
ara: فشل في إرسال أمر AUTH LOGIN command. الخطأ: %s

source: Failed to authenticate username. Error: %s
ara: فشل في التحقق من إسم المستخدم. الخطأ: %s

source: Failed to authenticate password. Error: %s
ara: فشل في التحقق من كلمة مرور. الخطأ: %s

source: Unable to send data: %s
ara: غير قادر على إرسال البيانات: %s

source: Exit status code: %s
ara: رمز الخطأ: %s

source: The %s field is required.
ara: الحقل %s إجباري.

source: The %s field must have a value.
ara: الحقل %s يجب أن يحتوى على قيمة.

source: The %s field must contain a valid email address.
ara: الحقل %s يجب أن يحتوى عنوان بريد إلكتروني صحيح.

source: The %s field must contain all valid email addresses.
ara: الحقل %s يجب أن يحتوى على عناوين بريد إلكتروني صحيحة.

source: The %s field must contain a valid URL.
ara: الحقل %s يجب أن يحتوى على رابط.

source: The %s field must contain a valid IP.
ara: الحقل %s يجب أن يحتوى على عنوان أي بي.

source: The %s field must be at least %s characters in length.
ara: الحقل %s يجب أن لا يقل عن %s حرف.

source: The %s field cannot exceed %s characters in length.
ara: الحقل %s يجب أن لا يتجاوز أكثر من %s حرف.

source: The %s field must be exactly %s characters in length.
ara: الحقل %s يجب أن يكون بطول %s حرف.

source: The %s field may only contain alphabetical characters.
ara: الحقل %s يمكن أن يحتوى على أحرف فقط.

source: The %s field may only contain alpha-numeric characters.
ara: الحقل %s يمكن أن يحتوى على أحرف وأرقام فقط.

source: The %s field may only contain alpha-numeric characters and spaces.
ara: الحقل %s يمكن أن يحتوى على أحرف وأرقام و فراغات فقط.

source: The %s field may only contain alpha-numeric characters, underscores, and dashes.
ara: الحقل %s يمكن أن يحتوى على أحرف وأرقام أو شرطة أو شرطة سفلية.

source: The %s field must contain only numbers.
ara: الحقل %s يجب أن يحتوى على أرقام فقط.

source: The %s field must contain only numeric characters.
ara: الحقل %s يجب أن يحتوى على أرقام فقط.

source: The %s field must contain an integer.
ara: الحقل %s يجب أن يحتوى على رقم صحيح فقط.

source: The %s field is not in the correct format.
ara: الحقل %s لا يحتوى على قيمة بشكل صحيح.

source: The %s field does not match the %s field.
ara: الحقل %s لا يساوي الحقل %s.

source: The %s field must differ from the %s field.
ara: الحقل %s يجب أن يكون مختلف عن الحقل %s.

source: The %s field must contain a unique value.
ara: الحقل %s يجب أن يحتوى على قيمة غير متكررة.

source: The %s field must only contain digits.
ara: الحقل %s يجب أن يحتوى على رقم.

source: The %s field must only contain digits and must be greater than zero.
ara: الحقل %s يجب أن يحتوى على رقم أكبر من صفر.

source: The %s field must contain a decimal number.
ara: الحقل %s يجب أن يحتوى على رقم عشري.

source: The %s field must contain a number less than %s.
ara: الحقل %s يجب أن يحتوى على رقم أقل من %s.

source: The %s field must contain a number less than or equal to %s.
ara: الحقل %s يجب أن يحتوى على رقم أقل أو يساوي %s.

source: The %s field must contain a number greater than %s.
ara: الحقل %s يجب أن يحتوى على رقم أكبر من %s.

source: The %s field must contain a number greater than or equal to %s.
ara: الحقل %s يجب أن يحتوى على رقم أكبر من أو يساوي %s.

source: Unable to access an error message corresponding to your field name %s.
ara: الحقل%s غير قادر على الوصول إلى رسالة خطأ المقابلة ل اسم مجال عملك.

source: The %s field must be one of: %s.
ara: يجب أن يكون الحقل %s واحدا من: %s.

source: Unable to locate a valid connection ID. Please make sure you are connected before performing any file routines.
ara: تعذّر العثور على مُعرّف اتصال صالح. الرجاء التأكّد من أنك متّصل قبل القيام بأية عمليات.

source: Unable to connect to your FTP server using the supplied hostname.
ara: تعذّر الاتّصال بخادم FTP من خلال اسم المضيف المحدّد.

source: Unable to login to your FTP server. Please check your username and password.
ara: تعذّر تسجيل الدخول إلى خادم FTP. الرجاء التحقّق من إسم المستخدم وكلمة السرّ.

source: Unable to create the directory you have specified.
ara: تعذّر إنشاء الدليل المُحدّد.

source: Unable to change directories.
ara: تعذّر الانتقال إلى الدليل.

source: Unable to set file permissions. Please check your path.
ara: تعذّر تعيين صلاحيات الملف. الرجاء التحقق من المسار. ملاحظة: هذه الميزة متوفّرة فقط في PHP الإصدار 5 أو الأحدث.

source: Unable to upload the specified file. Please check your path.
ara: تعذّر رفع الملف المحدّد. الرجاء التحقّق من المسار.

source: Unable to download the specified file. Please check your path.
ara: تعذّر تنزيل الملف المحدّد. الرجاء التحقّق من المسار.

source: Unable to locate the source file. Please check your path.
ara: تعذّر العثور على الملف المصدر. الرجاء التحقق من المسار.

source: Unable to rename the file.
ara: تعذّرت إعادة تسيمة الملف.

source: Unable to delete the file.
ara: تعذّر حذف الملف.

source: Unable to move the file. Please make sure the destination directory exists.
ara: تعذّر نقل الملف. الرجاء التأكد من وجود الدليل الهدف.

source: You must specify a source image in your preferences.
ara: يجب تحديد مصدر الصورة في التفضيلات.

source: The GD image library is required for this feature.
ara: مكتبة الصور GD مطلوبة لهذه الميزة.

source: Your server must support the GD image library in order to determine the image properties.
ara: لتحديد خصائص الصورة يجب تفعيل مكتبة GD على الخادم.

source: Your server does not support the GD function required to process this type of image.
ara: مكتبة الصور GD لا تدعم التعامل مع هذا النوع من الصور.

source: GIF images are often not supported due to licensing restrictions. You may have to use JPG or PNG images instead.
ara: صور GIF غالبا غير مدعوة بسبب قيود الترخيص, بدلا من ذلك إستخدم صور من نوع JPG او PNG.

source: JPG images are not supported.
ara: الصور من نوع JPG غير مدعومة.

source: PNG images are not supported.
ara: الصور من نوع PNG غير مدعومة.

source: The image resize protocol specified in your preferences only works with JPEG or PNG image types.
ara: بروتوكول تغير الحجم المحدد في تفضيلات الصور يعمل فقط مع الصور من نوع JPG و PNG.

source: An error was encountered while attempting to replace the file. Please make sure your file directory is writable.
ara: حدث خطأ اثناء عملية إستبدال الملف. الرجاء التأكد من أن المجلد قابل للكتابة.

source: Image rotation does not appear to be supported by your server.
ara: تدوير الصور غير مدعوم في الخادم.

source: The path to your image library is not correct. Please set the correct path in your image preferences.
ara: مسار مكتبة الصو غير صحيح. الرجاء ضع مسار صحيح في تفضيلات الصورة.

source: Image processing failed. Please verify that your server supports the chosen protocol and that the path to your image library is correct.
ara: معالجة الصورة فشلت. الرجاء التحقق من أن الخادم يدعم بروتوكول الصور و مسار مكتبة الصور صحيح.

source: An angle of rotation is required to rotate the image.
ara: زاوية الدوران مطلوبة لتدوير الصورة.

source: The path to the image is not correct.
ara: مسار الصورة غير صحيح.

source: The provided image is not valid.
ara: الصورة غير صحيحة.

source: The image copy routine failed.
ara: عملية نسخ الصورة فشلت.

source: Unable to find a font to use.
ara: غير قادر على إيجاد الخط.

source: Unable to save the image. Please make sure the image and file directory are writable.
ara: غير قادر على حفظ الصورة. الرجاء التأكد من أن ملف الصورة والمجلد قابلة للكتابة.

source: No migrations were found.
ara: لا يوجد أي عمليات ترحيل.

source: No migration could be found with the version number: %s.
ara: تعذر العثور على عملية الترحيل هذه.

source: There is a gap in the migration sequence near version number: %s.
ara: هناك فجوة بين تسلسل عمليات الترحيل عند الرقم : %s.

source: There are multiple migrations with the same version number: %s.
ara: هناك عدة عمليات ترحيل لها نفس التعداد: %s.

source: The migration class "%s" could not be found.
ara: تعذر العثور على صنف الترحيل "%s".

source: The migration class "%s" is missing an "up" method.
ara: صنيف الترحيل "%s" يفتقد إلى دالة "up".

source: The migration class "%s" is missing a "down" method.
ara: صنف الترحيل "%s" يفتقد إلى دالة "down".

source: Migration "%s" has an invalid filename.
ara: اسم الملف الخاص بالترحيل "%s" غير صحيح.

source: TB
ara: ت.ب

source: GB
ara: ج.ب

source: MB
ara: م.ب

source: KB
ara: ك.ب

source: Bytes
ara: بايت

source: &lsaquo; First
ara: &lsaquo; الأول

source: Last &rsaquo;
ara: الأخير &rsaquo;

source: DATABASE
ara: قاعدة البيانات

source: CLASS/METHOD
ara: الصنف/الدالة

source: BENCHMARKS
ara: بيانات التقييم

source: QUERIES
ara: الاستعلامات

source: GET DATA
ara: بيانات GET

source: POST DATA
ara: بيانات POST

source: URI STRING
ara: سطر URI

source: MEMORY USAGE
ara: استهلاك الذاكرة

source: CONFIG VARIABLES
ara: متغيّرات التهيئة

source: SESSION DATA
ara: بيانات الجلسة

source: HTTP HEADERS
ara: ترويسات HTTP

source: Database driver is not currently loaded
ara: لا يوجد أي مُعرف قاعدة بيانات مُحمّل حالياً

source: No queries were run
ara: لم تنفّذ أية استعلامات

source: No POST data exists
ara: ليس هناك بيانات POST

source: No GET data exists
ara: ليس هناك بيانات GET

source: No URI data exists
ara: ليس هناك بيانات URI

source: Memory Usage Unavailable
ara: بيانات استهلاك الذاكرة غير متوفرة

source: No Profile data - all Profiler sections have been disabled.
ara: لا يوجد أي بيانات تقييم حيث أن جميع أقسام التقييم مُعطّلة.

source: Hide
ara: اخفاء

source: Show
ara: اظهار

source: seconds
ara: ثواني

source: Test Name
ara: إسم الإختبار

source: Test Datatype
ara: اختبار نوع البيانات

source: Expected Datatype
ara: نوع البيانات المتوقّع

source: Result
ara: النتيجة

source: Undefined Test Name
ara: اسم اختبار غير محدد

source: File Name
ara: إسم الملف

source: Line Number
ara: رقم السطر

source: Passed
ara: نجح

source: Failed
ara: فشل

source: Boolean
ara: منطقي

source: Integer
ara: عدد صحيح

source: Float
ara: عدد تعويم

source: Double
ara: عدد تعويم

source: String
ara: سلسلة

source: Array
ara: مجموعة

source: Object
ara: فئة

source: Resource
ara: مَوْرد

source: Null
ara: لا شيء

source: Notes
ara: ملاحظات

source: Unable to find a post variable called userfile.
ara: تعذر العثور على متغيّر POST بالاسم userfile.

source: The uploaded file exceeds the maximum allowed size in your PHP configuration file.
ara: حجم الملف المرفوع أكبر من الحجم الأقصى المسموح به في ملف تهيئة PHP.

source: The uploaded file exceeds the maximum size allowed by the submission form.
ara: حجم الملف المرفوع أكبر من الحجم الأقصى المسموح به في استمارة الإرسال.

source: The file was only partially uploaded.
ara: تم رفع جزء من الملف فقط.

source: The temporary folder is missing.
ara: المجلد المؤقت مفقود.

source: The file could not be written to disk.
ara: تعذر حفظ الملف على الخادم.

source: The file upload was stopped by extension.
ara: أوقف رفع الملف بسبب نوعه.

source: You did not select a file to upload.
ara: لم تختر ملف لرفعه.

source: The filetype you are attempting to upload is not allowed.
ara: نوع الملف الذي تحاول رفعه غير مسموح.

source: The file you are attempting to upload is larger than the permitted size.
ara: الملف الذي تحاول رفعه أكبر من الحجم المسموح به.

source: The image you are attempting to upload doesn't fit into the allowed dimensions.
ara: طول أو عرض الصورة التي تحاول رفعها أكبر من الحدّ المُعيّن.

source: A problem was encountered while attempting to move the uploaded file to the final destination.
ara: حدث خطأ أثناء محاولة نقل الملف المرفوع إلى الموضع النهائي.

source: The upload path does not appear to be valid.
ara: يبدو أن مسار رفع الملفات غير صحيح.

source: You have not specified any allowed file types.
ara: لم تقم بتحديد أنواع الملفات المسموح رفعها.

source: The file name you submitted already exists on the server.
ara: اسم الملف الذي ترفعه موجود مسبقاً

source: The upload destination folder does not appear to be writable.
ara: يبدو أن المجلد المطلوب رفع الملفات إليه لا يمكن الكتابة فيه.
