Repository: bkader/ci-gettext-hook
Catalog: application/language/*/system.po
Languages: french

source: The uploaded file exceeds the maximum size allowed by the submission form.
french: Le fichier chargé dépasse la taille limite définie par le formulaire d'envoi.

source: The file was only partially uploaded.
french: Le fichier n'a été que partiellement envoyé.

source: The temporary folder is missing.
french: Le dossier temporaire manque.

source: The file could not be written to disk.
french: Impossible d'écrire le fichier sur disque.

source: The file upload was stopped by extension.
french: Le chargement du fichier a été arrêté par extension.

source: You did not select a file to upload.
french: Vous n'avez pas sélectionné de fichier à envoyer.

source: The filetype you are attempting to upload is not allowed.
french: Le type de fichier que vous tentez d'envoyer n'est pas autorisé.

source: The file you are attempting to upload is larger than the permitted size.
french: Le fichier que vous tentez d'envoyer est plus gros que la taille autorisée.

source: The image you are attempting to upload doesn't fit into the allowed dimensions.
french: L'image que vous tentez d'envoyer dépasse les valeurs maximales autorisées pour la hauteur ou la largeur.

source: A problem was encountered while attempting to move the uploaded file to the final destination.
french: Une erreur est survenue lors du déplacement du fichier envoyé vers sa destination finale.

source: The upload path does not appear to be valid.
french: Le chemin de destination semble invalide.

source: You have not specified any allowed file types.
french: Vous n'avez pas spécifié les types de fichier autorisés.

source: The file name you submitted already exists on the server.
french: Un fichier avec le même nom que celui que vous avez envoyé existe déjà sur le serveur.

source: The upload destination folder does not appear to be writable.
french: Le répertoire de destination ne semble pas être accessible en écriture.
