Repository: bkader/ci-gettext-hook
Catalog: application/language/*/system.po
Languages: french

source: Su
french: Di

source: Mo
french: Lu

source: Tu
french: Ma

source: We
french: Me

source: Th
french: Je

source: Fr
french: Ve

source: Sun
french: Dim

source: Mon
french: Lun

source: Tue
french: Mar

source: Wed
french: Mer

source: Thu
french: Jeu

source: Fri
french: Ven

source: Sat
french: Sam

source: Sunday
french: Dimanche

source: Monday
french: Lundi

source: Tuesday
french: Mardi

source: Wednesday
french: Mercredi

source: Thursday
french: Jeudi

source: Friday
french: Vendredi

source: Saturday
french: Samedi

source: Feb
french: Fév

source: Apr
french: Avr

source: May
french: Mai

source: Jun
french: Juin

source: Jul
french: Juil

source: Aug
french: Aoû

source: Dec
french: Déc

source: January
french: Janvier

source: February
french: Février

source: March
french: Mars

source: April
french: Avril

source: June
french: Juin

source: July
french: Juillet

source: August
french: Août

source: September
french: Septembre

source: October
french: Octobre

source: November
french: Novembre

source: December
french: Décembre

source: Year
french: Année

source: Years
french: Années

source: Month
french: Mois

source: Months
french: Mois

source: Week
french: Semaine

source: Weeks
french: Semaines

source: Day
french: Jour

source: Days
french: Jours

source: Hour
french: Heure

source: Hours
french: Heures

source: Second
french: Seconde

source: Seconds
french: Secondes

source: (UTC -12:00) Baker/Howland Island
french: (UTC -12:00) Îles Baker / Howland

source: (UTC -11:00) Niue
french: (UTC -11:00) Samoa fuseau horaire, Niue

source: (UTC -10:00) Hawaii-Aleutian Standard Time, Cook Islands, Tahiti
french: (UTC -10:00) Hawaï et les Aléoutiennes, Îles Cook, Tahiti

source: (UTC -9:30) Marquesas Islands
french: (UTC -9:30) Îles Marquises

source: (UTC -9:00) Alaska Standard Time, Gambier Islands
french: (UTC -9:00) Heure normale d'Alaska, Îles Gambier

source: (UTC -8:00) Pacific Standard Time, Clipperton Island
french: (UTC -8:00) Heure du Pacifique

source: (UTC -7:00) Mountain Standard Time
french: (UTC -7:00) Heure des Rocheuses

source: (UTC -6:00) Central Standard Time
french: (UTC -6:00) Heure centrale

source: (UTC -5:00) Eastern Standard Time, Western Caribbean Standard Time
french: (UTC -5:00) Heure de l'Est, heure normale de l'Ouest des Caraïbes

source: (UTC -4:30) Venezuelan Standard Time
french: (UTC -4:30) Heure normale vénézuélienne

source: (UTC -4:00) Atlantic Standard Time, Eastern Caribbean Standard Time
french: (UTC -4:00) Heure de l'Atlantique, heure normale de l'Est des Caraïbes

source: (UTC -3:30) Newfoundland Standard Time
french: (UTC -3:30) Heure normale de Terre-Neuve

source: (UTC -3:00) Argentina, Brazil, French Guiana, Uruguay
french: (UTC -3:00) Argentine, Brésil, Guyane Française, Uruguay

source: (UTC -2:00) South Georgia/South Sandwich Islands
french: (UTC -2:00) Géorgie du Sud/Îles Sandwich du Sud

source: (UTC -1:00) Azores, Cape Verde Islands
french: (UTC -1:00) Açores, Cap-Vert

source: (UTC) Greenwich Mean Time, Western European Time
french: (UTC) Greenwich heure normale, heure d'Europe occidentale

source: (UTC +1:00) Central European Time, West Africa Time
french: (UTC +1:00) Heure d'Europe centrale, heure normale d'Afrique de l'Ouest

source: (UTC +2:00) Central Africa Time, Eastern European Time, Kaliningrad Time
french: (UTC +2:00) Heure normale d'Afrique centrale, heure d'Europe orientale, heure normale de Kaliningrad

source: (UTC +3:00) Moscow Time, East Africa Time, Arabia Standard Time
french: (UTC +3:00) Heure de Moscou, heure normale d'Afrique de l'Est

source: (UTC +3:30) Iran Standard Time
french: (UTC +3:30) Heure normale d'Iran

source: (UTC +4:00) Azerbaijan Standard Time, Samara Time
french: (UTC +4:00) Heure normale d'Azerbaïdjan, heure normale de Samara

source: (UTC +4:30) Afghanistan
french: (UTC +4:30) Heure normale d'Afghanistan

source: (UTC +5:00) Pakistan Standard Time, Yekaterinburg Time
french: (UTC +5:00) Heure normale de Pakistan, Ekaterinbourg

source: (UTC +5:30) Indian Standard Time, Sri Lanka Time
french: (UTC +5:30) Heure normale d'Inde, heure Sri Lanka

source: (UTC +5:45) Nepal Time
french: (UTC +5:45) Heure Népal

source: (UTC +6:00) Bangladesh Standard Time, Bhutan Time, Omsk Time
french: (UTC +6:00) Heure Bangladesh, Bhoutan, Omsk

source: (UTC +6:30) Cocos Islands, Myanmar
french: (UTC +6:30) Îles Cocos, Myanmar

source: (UTC +7:00) Krasnoyarsk Time, Cambodia, Laos, Thailand, Vietnam
french: (UTC +7:00) Heure Krasnoïarsk, Cambodge, Laos, Thaïlande, Viêt Nam

source: (UTC +8:00) Australian Western Standard Time, Beijing Time, Irkutsk Time
french: (UTC +8:00) Heure normale de l'Ouest de l'Australie, heure Beijing, Irkoutsk

source: (UTC +8:45) Australian Central Western Standard Time
french: (UTC +8:45) Heure normale de l'Ouest de l'Australie centrale

source: (UTC +9:00) Japan Standard Time, Korea Standard Time, Yakutsk Time
french: (UTC +9:00) Heure normale du Japon, heure normale de la Corée, heure Yakutsk

source: (UTC +9:30) Australian Central Standard Time
french: (UTC +9:30) Heure normale de l'Australie centrale

source: (UTC +10:00) Australian Eastern Standard Time, Vladivostok Time
french: (UTC +10:00) Heure normale de l'Australie occidentale, heure Vladivostok

source: (UTC +10:30) Lord Howe Island
french: (UTC +10:30) L'île de Lord How

source: (UTC +11:00) Srednekolymsk Time, Solomon Islands, Vanuatu
french: (UTC +11:00) Heure Magadan, heure Nouvelle-Calédonie, Îles Salomon

source: (UTC +11:30) Norfolk Island
french: (UTC +11:30) Île Norfolk

source: (UTC +12:00) Fiji, Gilbert Islands, Kamchatka Time, New Zealand Standard Time
french: (UTC +12:00) Heure Fidji, Îles Gilbert, Kamchatka, heure normale de la Nouvelle-Zélande

source: (UTC +12:45) Chatham Islands Standard Time
french: (UTC +12:45) Heure normale des Îles Chatham

source: (UTC +13:00) Samoa Time Zone, Phoenix Islands Time, Tonga
french: (UTC +13:00) Heure normale des Îles Phénix, heure Tonga

source: (UTC +14:00) Line Islands
french: (UTC +14:00) Heure normale des Îles Line

source: Unable to determine the database settings based on the connection string you submitted.
french: Impossible de déterminer les paramètres d'accès à la base de données en se basant sur la chaîne de connexion que vous avez fournie.

source: Unable to connect to your database server using the provided settings.
french: Impossible de se connecter à la base de données en utilisant les paramètres fournis.

source: Unable to select the specified database: %s
french: Impossible de sélectionner cette base de données : %s

source: Unable to create the specified database: %s
french: Impossible de créer cette base de données : %s

source: The query you submitted is not valid.
french: La requête que vous avez fournie est invalide.

source: You must set the database table to be used with your query.
french: Vous devez spécifier une table pour effectuer votre requête.

source: You must use the "set" method to update an entry.
french: Vous devez utiliser la méthode "set()" pour mettre à jour une entrée.

source: You must specify an index to match on for batch updates.
french: Vous devez spécifier un index pour les mises à jour groupées.

source: One or more rows submitted for batch updating is missing the specified index.
french: Une ou plusieurs rangées de la mise à jour groupée ne disposent pas de l'index requis.

source: Updates are not allowed unless they contain a "where" clause.
french: Il faut obligatoirement spécifier la clause "WHERE" pour mettre à jour une entrée.

source: Deletes are not allowed unless they contain a "where" or "like" clause.
french: Il faut obligatoirement spécifier la clause "WHERE" pour supprimer une entrée.

source: To fetch fields requires the name of the table as a parameter.
french: La méthode "fetch_fields()" requiert le nom de la table cible en paramètre.

source: This feature is not available for the database you are using.
french: Cette fonctionnalité n'est pas disponible pour la base de données utilisée.

source: Transaction failure: Rollback performed.
french: Erreur de transaction : la transaction est annulée.

source: Unable to drop the specified database.
french: Impossible d'effacer la base de données spécifiée.

source: Unsupported feature of the database platform you are using.
french: Cette fonctionnalité n'est pas supportée par le système de gestion de bases de données utilisé.

source: The file compression format you chose is not supported by your server.
french: Le format de compression choisi n'est pas supporté par votre serveur.

source: Unable to write data to the file path you have submitted.
french: Impossible d'écrire des données au chemin de fichiers indiqué.

source: The cache path you submitted is not valid or writable.
french: Le chemin de mise en cache indiqué n'est pas valide ou inscriptible.

source: A table name is required for that operation.
french: Un nom de table est requis pour cette opération.

source: A column name is required for that operation.
french: Un nom de champ est requis pour cette opération.

source: A column definition is required for that operation.
french: Une définition de champ est requise pour cette opération.

source: Unable to set client connection character set: %s
french: Impossible de définir le jeu de caractères de la connexion client : %s

source: A Database Error Occurred
french: Une erreur de la base de données s'est produite.

source: The email validation method must be passed an array.
french: La méthode de validation d'email n'accepte que les tableaux associatifs (array).

source: Invalid email address: %s
french: Adresse email invalide : %s

source: Unable to locate the following email attachment: %s
french: Impossible de localiser le fichier joint suivant : %s

source: Unable to open this attachment: %s
french: Impossible d'ouvrir ce fichier joint : %s

source: Cannot send mail with no "From" header.
french: Impossible d'envoyer un email sans en-tête "From".

source: You must include recipients: To, Cc, or Bcc
french: Vous devez spécifier des destinataires: To, Cc, ou Bcc

source: Unable to send email using PHP mail(). Your server might not be configured to send mail using this method.
french: Impossible d'envoyer des emails avec la fonction mail() de PHP. Votre serveur ne doit pas être configuré pour pouvoir utiliser cette méthode.

source: Unable to send email using PHP Sendmail. Your server might not be configured to send mail using this method.
french: Impossible d'envoyer des emails avec la méthode Sendmail de PHP. Votre serveur ne doit pas être configuré pour pouvoir utiliser cette méthode.

source: Unable to send email using PHP SMTP. Your server might not be configured to send mail using this method.
french: Impossible d'envoyer des emails avec la méthode SMTP de PHP. Votre serveur ne doit pas être configuré pour pouvoir utiliser cette méthode.

source: Your message has been successfully sent using the following protocol: %s
french: Votre message a bien été expédié par le protocole suivant : %s

source: Unable to open a socket to Sendmail. Please check settings.
french: Impossible d'ouvrir un socket avec Sendmail. Veuillez vérifier la configuration de votre environnement.

source: You did not specify a SMTP hostname.
french: Vous n'avez pas spécificé d'hôte SMTP.

source: The following SMTP error was encountered: %s
french: L'erreur SMTP suivante s'est produite : %s

source: Error: You must assign a SMTP username and password.
french: Erreur : Vous devez spécifier un nom d'utilisateur et un mot de passe SMTP.

source: Failed to send AUTH LOGIN command. Error: %s
french: Échec lors de l'envoi de la commande AUTH LOGIN. Erreur : %s

source: Failed to authenticate username. Error: %s
french: Impossible d'identifier le nom d'utilisateur. Erreur : %s

source: Failed to authenticate password. Error: %s
french: Impossible d'identifier le mot de passe. Erreur : %s

source: Unable to send data: %s
french: Impossible d'envoyer les données : %s

source: Exit status code: %s
french: Code de retour : %s

source: The %s field is required.
french: Le champ %s est requis.

source: The %s field must have a value.
french: Le champ %s doit avoir une valeur.

source: The %s field must contain a valid email address.
french: Le champ %s doit contenir une adresse email valide.

source: The %s field must contain all valid email addresses.
french: Le champ %s ne peut contenir que des adresses email valides.

source: The %s field must contain a valid URL.
french: Le champ %s doit contenir une URL valide.

source: The %s field must contain a valid IP.
french: Le champ %s doit contenir une IP valide.

source: The %s field must be at least %s characters in length.
french: Le champ %s doit contenir au moins %s caractères.

source: The %s field cannot exceed %s characters in length.
french: Le champ %s ne peut contenir plus de %s caractères.

source: The %s field must be exactly %s characters in length.
french: Le champ %s doit contenir exactement %s caractères.

source: The %s field may only contain alphabetical characters.
french: Le champ %s ne peut contenir que des caractères alphabétiques.

source: The %s field may only contain alpha-numeric characters.
french: Le champ %s ne peut contenir que des caractères alphanumériques.

source: The %s field may only contain alpha-numeric characters and spaces.
french: Le champ %s ne peut contenir que des caractères alphanumériques et des espaces.

source: The %s field may only contain alpha-numeric characters, underscores, and dashes.
french: Le champ %s ne peut contenir que des caractères alphanumériques, des caractères de soulignement et des traits d'union.

source: The %s field must contain only numbers.
french: Le champ %s doit contenir un nombre (caractères numériques).

source: The %s field must contain only numeric characters.
french: Le champ %s ne peut contenir que de signes du type nombre.

source: The %s field must contain an integer.
french: Le champ %s doit contenir un nombre entier.

source: The %s field is not in the correct format.
french: Le champ %s n'utilise pas le bon format.

source: The %s field does not match the %s field.
french: Le champ %s doit correspondre au champ %s.

source: The %s field must differ from the %s field.
french: Le champ %s doit être différent du champ %s.

source: The %s field must contain a unique value.
french: Le champ %s doit contenir une valeur unique.

source: The %s field must only contain digits.
french: Le champ %s ne peut contenir que des nombres positifs.

source: The %s field must only contain digits and must be greater than zero.
french: Le champ %s ne peut contenir que des nombres plus grands que zéro.

source: The %s field must contain a decimal number.
french: Le champ %s doit contenir un nombre décimal.

source: The %s field must contain a number less than %s.
french: Le champ %s doit contenir un nombre inférieur à %s.

source: The %s field must contain a number less than or equal to %s.
french: Le champ %s doit contenir un nombre inférieur ou égal à %s.

source: The %s field must contain a number greater than %s.
french: Le champ %s doit contenir un nombre supérieur à %s.

source: The %s field must contain a number greater than or equal to %s.
french: Le champ %s doit contenir un nombre supérieur ou égal à %s.

source: Unable to access an error message corresponding to your field name %s.
french: Impossible d'accéder à un message d'erreur correspondant à votre champ nommé %s.

source: The %s field must be one of: %s.
french: Le champ %s doit avoir une de ces valeurs : %s.

source: Unable to locate a valid connection ID. Please make sure you are connected before performing any file routines.
french: Impossible de déterminer une connexion valable. Veuillez vous assurer que vous êtes connecté(e) avant d'exécuter une tâche sur un fichier.

source: Unable to connect to your FTP server using the supplied hostname.
french: Connexion au serveur FTP impossible avec le nom d'hôte (hostname) spécifié.

source: Unable to login to your FTP server. Please check your username and password.
french: Connexion au serveur FTP impossible. Veuillez vérifier vos identifiants de connexion.

source: Unable to create the directory you have specified.
french: Impossible de créer le dossier spécifié.

source: Unable to change directories.
french: Impossible de changer de répertoire.

source: Unable to set file permissions. Please check your path.
french: Impossible de changer les permissions du fichier. Veuillez vérifier le chemin d'accès. Note : cette fonctionnalité n'est disponible qu'avec PHP en version 5 ou supérieure.

source: Unable to upload the specified file. Please check your path.
french: Impossible d'envoyer le fichier spécifié. Veuillez vérifier le chemin d'accès.

source: Unable to download the specified file. Please check your path.
french: Impossible de récupérer le fichier spécifié. Veuillez vérifier le chemin d'accès.

source: Unable to locate the source file. Please check your path.
french: Impossible de localiser le fichier source. Veuillez vérifier le chemin d'accès.

source: Unable to rename the file.
french: Impossible de renommer le fichier.

source: Unable to delete the file.
french: Impossible de supprimer le fichier.

source: Unable to move the file. Please make sure the destination directory exists.
french: Impossible de déplacer le fichier. Veuillez vous assurer que le répertoire de destination existe.

source: You must specify a source image in your preferences.
french: Vous devez spécifier une image source dans vos préférences.

source: The GD image library is required for this feature.
french: La librairie d'images GD est requise pour utiliser cette fonctionnalité.

source: Your server must support the GD image library in order to determine the image properties.
french: Votre serveur doit prendre en charge la librairie d'images GD afin de déterminer les propriétés de l'image.

source: Your server does not support the GD function required to process this type of image.
french: Votre serveur ne prend pas en charge les fonctions GD nécéssaires pour traiter ce type d'image.

source: GIF images are often not supported due to licensing restrictions. You may have to use JPG or PNG images instead.
french: Souvent, les images GIF ne sont pas prises en charge en raison de restrictions de licence. Vous pourriez avoir à utiliser des images JPG ou PNG à la place.

source: JPG images are not supported.
french: Les images JPG ne sont pas prises en charge.

source: PNG images are not supported.
french: Les images PNG ne sont pas prises en charge.

source: The image resize protocol specified in your preferences only works with JPEG or PNG image types.
french: Le protocole de redimensionnement d'images spécifié dans vos préférences fonctionne seulement avec les types d'images JPEG et PNG.

source: An error was encountered while attempting to replace the file. Please make sure your file directory is writable.
french: Une erreur est survenue lors du remplacement du fichier. Assurez-vous que le répertoire est accessible en écriture.

source: Image rotation does not appear to be supported by your server.
french: La rotation d'images ne semble pas être prise en charge par votre serveur.

source: The path to your image library is not correct. Please set the correct path in your image preferences.
french: Le chemin vers votre librairie d'images est incorrect. Veuillez enter le bon chemin dans les préférences de votre image.

source: Image processing failed. Please verify that your server supports the chosen protocol and that the path to your image library is correct.
french: Le traintement de l'image a échoué. Veuillez vous assurer que votre serveur prend en charge le protocole choisi et que le chemin vers votre librairie d'images est correct.

source: An angle of rotation is required to rotate the image.
french: Un angle de rotation est nécéssaire pour faire tourner l'image.

source: The path to the image is not correct.
french: Le chemin vers l'image est incorrect.

source: The image copy routine failed.
french: La routine de copie d'image a échouée.

source: Unable to find a font to use.
french: Impossible de trouver une police de caractères.

source: Unable to save the image. Please make sure the image and file directory are writable.
french: Impossible de sauvegarder l'image. Veuillez vous assurer que l'image et le répertoire sont accessibles en écriture.

source: No migrations were found.
french: Aucune migration trouvée.

source: No migration could be found with the version number: %s.
french: Aucune migration n'a été trouvée avec le numéro de version : %s.

source: There is a gap in the migration sequence near version number: %s.
french: Il y a un trou dans la séquence de migration près de la version numéro : %s.

source: There are multiple migrations with the same version number: %s.
french: Il y a plusieurs migrations avec le même numéro de version : %s.

source: The migration class "%s" could not be found.
french: La classe de migration "%s" n'a pas pu être trouvée.

source: The migration class "%s" is missing an "up" method.
french: La classe de migration "%s" ne dispose pas d'une méthode 'up'.

source: The migration class "%s" is missing a "down" method.
french: La classe de migration "%s" ne dispose pas d'une méthode 'down'.

source: Migration "%s" has an invalid filename.
french: Le nom de fichier de la migration "%s" n'est pas valide.

source: TB
french: To

source: GB
french: Go

source: MB
french: Mo

source: KB
french: Ko

source: Bytes
french: Octets

source: &lsaquo; First
french: &lsaquo; Première

source: Last &rsaquo;
french: Dernière &rsaquo;

source: DATABASE
french: BASE DE DONNEES

source: CLASS/METHOD
french: CLASSE/METHODE

source: QUERIES
french: REQUETES

source: GET DATA
french: DONNEES GET

source: POST DATA
french: DONNEES POST

source: MEMORY USAGE
french: UTILISATION MEMOIRE

source: CONFIG VARIABLES
french: VARIABLES CONFIG

source: SESSION DATA
french: DONNEES SESSION

source: HTTP HEADERS
french: EN-TETES HTTP

source: Database driver is not currently loaded
french: Le driver de la base de données n'est actuellement pas chargé

source: No queries were run
french: Aucune requête n'a été exécutée

source: No POST data exists
french: Aucune donnée POST n'existe

source: No GET data exists
french: Aucune donnée GET n'existe

source: No URI data exists
french: Aucune donnée URI n'existe

source: Memory Usage Unavailable
french: Utilisation de la mémoire indisponible

source: No Profile data - all Profiler sections have been disabled.
french: Pas de données du profil - toute section est desactivée.

source: Hide
french: Cacher

source: Show
french: Montrer

source: seconds
french: secondes

source: Test Name
french: Nom du test

source: Test Datatype
french: Type des données de test

source: Expected Datatype
french: Type attendu

source: Result
french: Résultat

source: Undefined Test Name
french: Nom du test non défini

source: File Name
french: Nom du fichier

source: Line Number
french: Numéro de ligne

source: Passed
french: Passé

source: Failed
french: Échoué

source: Boolean
french: Booléen

source: Integer
french: Nombre entier

source: Float
french: Nombre réel

source: Double
french: Nombre réel

source: String
french: Chaine de caractères

source: Array
french: Tableau

source: Object
french: Objet

source: Resource
french: Ressource

source: Unable to find a post variable called userfile.
french: Impossible de trouver une variable de type POST nommée userfile.

source: The uploaded file exceeds the maximum allowed size in your PHP configuration file.
french: Le fichier envoyé dépasse la taille limite définie dans votre fichier de configuration PHP.
